benchmarkingExperiments/data/initial_experiments/4t4c100rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  4 threads and 4 connections
  Thread calibration: mean lat.: 12.325ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 13.048ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 13.294ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 13.811ms, rate sampling interval: 46ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.82ms    6.97ms  88.26ms   93.48%
    Req/Sec    24.82      6.69    50.00     90.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.86ms
 75.000%    8.37ms
 90.000%   13.08ms
 99.000%   37.12ms
 99.900%   77.57ms
 99.990%   87.93ms
 99.999%   88.32ms
100.000%   88.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.787     0.000000            1         1.00
       5.647     0.100000          502         1.11
       6.115     0.200000         1000         1.25
       6.415     0.300000         1507         1.43
       6.647     0.400000         2000         1.67
       6.855     0.500000         2505         2.00
       6.963     0.550000         2753         2.22
       7.095     0.600000         3006         2.50
       7.259     0.650000         3251         2.86
       7.559     0.700000         3502         3.33
       8.367     0.750000         3750         4.00
       9.023     0.775000         3875         4.44
       9.663     0.800000         4001         5.00
      10.319     0.825000         4126         5.71
      10.967     0.850000         4250         6.67
      11.743     0.875000         4375         8.00
      12.263     0.887500         4438         8.89
      13.079     0.900000         4500        10.00
      14.039     0.912500         4563        11.43
      15.007     0.925000         4625        13.33
      16.119     0.937500         4688        16.00
      17.055     0.943750         4719        17.78
      18.431     0.950000         4750        20.00
      20.143     0.956250         4782        22.86
      22.415     0.962500         4813        26.67
      24.959     0.968750         4845        32.00
      26.431     0.971875         4860        35.56
      27.471     0.975000         4875        40.00
      28.799     0.978125         4891        45.71
      30.207     0.981250         4907        53.33
      31.343     0.984375         4922        64.00
      31.855     0.985938         4930        71.11
      32.655     0.987500         4938        80.00
      34.175     0.989062         4946        91.43
      39.263     0.990625         4954       106.67
      47.935     0.992188         4961       128.00
      51.743     0.992969         4965       142.22
      55.135     0.993750         4969       160.00
      58.399     0.994531         4973       182.86
      61.215     0.995313         4977       213.33
      65.343     0.996094         4981       256.00
      70.079     0.996484         4983       284.44
      70.719     0.996875         4985       320.00
      72.831     0.997266         4987       365.71
      73.407     0.997656         4989       426.67
      74.367     0.998047         4991       512.00
      74.815     0.998242         4992       568.89
      75.007     0.998437         4993       640.00
      76.799     0.998633         4994       731.43
      77.567     0.998828         4995       853.33
      78.591     0.999023         4996      1024.00
      78.591     0.999121         4996      1137.78
      81.151     0.999219         4997      1280.00
      81.151     0.999316         4997      1462.86
      81.727     0.999414         4998      1706.67
      81.727     0.999512         4998      2048.00
      81.727     0.999561         4998      2275.56
      87.935     0.999609         4999      2560.00
      87.935     0.999658         4999      2925.71
      87.935     0.999707         4999      3413.33
      87.935     0.999756         4999      4096.00
      87.935     0.999780         4999      4551.11
      88.319     0.999805         5000      5120.00
      88.319     1.000000         5000          inf
#[Mean    =        8.820, StdDeviation   =        6.965]
#[Max     =       88.256, Total count    =         5000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6004 requests in 1.00m, 1.07MB read
Requests/sec:    100.05
Transfer/sec:     18.27KB