benchmarkingExperiments/data/initial_experiments/4t4c200rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  4 threads and 4 connections
  Thread calibration: mean lat.: 9.253ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 9.117ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 8.922ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 8.915ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.37ms   69.61ms 422.14ms   92.23%
    Req/Sec    50.68     18.61   115.00     63.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.32ms
 75.000%    9.78ms
 90.000%   14.92ms
 99.000%  365.82ms
 99.900%  412.93ms
 99.990%  421.89ms
 99.999%  422.40ms
100.000%  422.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.337     0.000000            1         1.00
       5.731     0.100000         1003         1.11
       6.255     0.200000         2008         1.25
       6.587     0.300000         3011         1.43
       6.899     0.400000         4012         1.67
       7.319     0.500000         5006         2.00
       7.727     0.550000         5502         2.22
       8.279     0.600000         6000         2.50
       8.759     0.650000         6505         2.86
       9.247     0.700000         7002         3.33
       9.783     0.750000         7506         4.00
      10.095     0.775000         7751         4.44
      10.399     0.800000         8001         5.00
      10.799     0.825000         8251         5.71
      11.311     0.850000         8500         6.67
      12.175     0.875000         8750         8.00
      12.999     0.887500         8876         8.89
      14.919     0.900000         9001        10.00
      35.135     0.912500         9126        11.43
     113.791     0.925000         9250        13.33
     172.287     0.937500         9375        16.00
     195.583     0.943750         9438        17.78
     213.375     0.950000         9500        20.00
     225.791     0.956250         9564        22.86
     240.255     0.962500         9625        26.67
     265.215     0.968750         9688        32.00
     285.183     0.971875         9719        35.56
     296.959     0.975000         9750        40.00
     310.527     0.978125         9783        45.71
     324.351     0.981250         9814        53.33
     335.103     0.984375         9844        64.00
     342.015     0.985938         9860        71.11
     354.047     0.987500         9875        80.00
     361.983     0.989062         9891        91.43
     369.151     0.990625         9907       106.67
     378.367     0.992188         9922       128.00
     382.719     0.992969         9930       142.22
     385.279     0.993750         9938       160.00
     390.655     0.994531         9946       182.86
     393.215     0.995313         9954       213.33
     397.823     0.996094         9961       256.00
     400.127     0.996484         9965       284.44
     400.895     0.996875         9969       320.00
     401.663     0.997266         9973       365.71
     404.479     0.997656         9977       426.67
     406.527     0.998047         9981       512.00
     407.807     0.998242         9983       568.89
     411.135     0.998437         9986       640.00
     411.903     0.998633         9987       731.43
     412.671     0.998828         9989       853.33
     413.695     0.999023         9991      1024.00
     414.719     0.999121         9992      1137.78
     415.487     0.999219         9993      1280.00
     416.511     0.999316         9994      1462.86
     417.023     0.999414         9995      1706.67
     418.047     0.999512         9997      2048.00
     418.047     0.999561         9997      2275.56
     418.047     0.999609         9997      2560.00
     418.047     0.999658         9997      2925.71
     421.119     0.999707         9998      3413.33
     421.119     0.999756         9998      4096.00
     421.119     0.999780         9998      4551.11
     421.887     0.999805         9999      5120.00
     421.887     0.999829         9999      5851.43
     421.887     0.999854         9999      6826.67
     421.887     0.999878         9999      8192.00
     421.887     0.999890         9999      9102.22
     422.399     0.999902        10000     10240.00
     422.399     1.000000        10000          inf
#[Mean    =       27.375, StdDeviation   =       69.614]
#[Max     =      422.144, Total count    =        10000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12004 requests in 1.00m, 2.14MB read
Requests/sec:    200.04
Transfer/sec:     36.53KB