benchmarkingExperiments/data/initial_experiments/4t4c700rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  4 threads and 4 connections
  Thread calibration: mean lat.: 1208.252ms, rate sampling interval: 4915ms
  Thread calibration: mean lat.: 1318.982ms, rate sampling interval: 5079ms
  Thread calibration: mean lat.: 1315.171ms, rate sampling interval: 5226ms
  Thread calibration: mean lat.: 1202.077ms, rate sampling interval: 4743ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.32s     4.49s   18.10s    55.83%
    Req/Sec   122.45     13.47   135.00     89.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.35s 
 75.000%   14.12s 
 90.000%   16.22s 
 99.000%   17.68s 
 99.900%   18.07s 
 99.990%   18.12s 
 99.999%   18.12s 
100.000%   18.12s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2723.839     0.000000            1         1.00
    4046.847     0.100000         2439         1.11
    5316.607     0.200000         4885         1.25
    6742.015     0.300000         7314         1.43
    8351.743     0.400000         9758         1.67
   11354.111     0.500000        12191         2.00
   11935.743     0.550000        13425         2.22
   12476.415     0.600000        14630         2.50
   13058.047     0.650000        15860         2.86
   13582.335     0.700000        17077         3.33
   14123.007     0.750000        18301         4.00
   14401.535     0.775000        18904         4.44
   14745.599     0.800000        19507         5.00
   15228.927     0.825000        20128         5.71
   15556.607     0.850000        20744         6.67
   15884.287     0.875000        21332         8.00
   16056.319     0.887500        21637         8.89
   16220.159     0.900000        21944        10.00
   16359.423     0.912500        22264        11.43
   16482.303     0.925000        22554        13.33
   16605.183     0.937500        22857        16.00
   16687.103     0.943750        23010        17.78
   16760.831     0.950000        23164        20.00
   16859.135     0.956250        23323        22.86
   16941.055     0.962500        23479        26.67
   17022.975     0.968750        23624        32.00
   17088.511     0.971875        23692        35.56
   17186.815     0.975000        23775        40.00
   17285.119     0.978125        23846        45.71
   17399.807     0.981250        23923        53.33
   17514.495     0.984375        23999        64.00
   17563.647     0.985938        24045        71.11
   17596.415     0.987500        24075        80.00
   17645.567     0.989062        24112        91.43
   17711.103     0.990625        24159       106.67
   17776.639     0.992188        24191       128.00
   17809.407     0.992969        24212       142.22
   17858.559     0.993750        24232       160.00
   17874.943     0.994531        24245       182.86
   17907.711     0.995313        24275       213.33
   17924.095     0.996094        24288       256.00
   17940.479     0.996484        24300       284.44
   17956.863     0.996875        24309       320.00
   17973.247     0.997266        24320       365.71
   17973.247     0.997656        24320       426.67
   18006.015     0.998047        24330       512.00
   18038.783     0.998242        24345       568.89
   18038.783     0.998437        24345       640.00
   18038.783     0.998633        24345       731.43
   18055.167     0.998828        24352       853.33
   18071.551     0.999023        24365      1024.00
   18071.551     0.999121        24365      1137.78
   18071.551     0.999219        24365      1280.00
   18071.551     0.999316        24365      1462.86
   18071.551     0.999414        24365      1706.67
   18087.935     0.999512        24370      2048.00
   18087.935     0.999561        24370      2275.56
   18087.935     0.999609        24370      2560.00
   18087.935     0.999658        24370      2925.71
   18087.935     0.999707        24370      3413.33
   18104.319     0.999756        24374      4096.00
   18104.319     0.999780        24374      4551.11
   18104.319     0.999805        24374      5120.00
   18104.319     0.999829        24374      5851.43
   18104.319     0.999854        24374      6826.67
   18120.703     0.999878        24377      8192.00
   18120.703     1.000000        24377          inf
#[Mean    =    10319.119, StdDeviation   =     4491.182]
#[Max     =    18104.320, Total count    =        24377]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29423 requests in 1.00m, 5.25MB read
Requests/sec:    490.35
Transfer/sec:     89.55KB